from itertools import count

#text = input("введите предложение")
#print(text.replace(" ","_"))
#print("количество пробелов =", text.count(" "))
#text = input("введите предложение")


#word = "привет"
#for i in range(len(word), -1, -1):
#    print(word[:i])

#word = "привет"
#for i in range(len(word) + 1):
#    print(word[i:])

#text = "пр_ив_ет"

#count = 0
#for ch in text:
#    in ch == "_":
#    count += 1
#print("количество подчеркиваний:", count)

#numbers = []
#n = int(input("Сколько чисел будет в списке: "))
#for i in range(n):
#    num = int(input(f"Введите число {i+1}: "))
#    numbers.append(num)
#result = sum(numbers)
#average = result / len(numbers)
#maximum = max(numbers)
#minimum = min(numbers)

#print("Список чисел: ", numbers)
#print("Сумма чисел: ", result)
#print("Среднее арифиметическое: ", average)
#print("Максимум: ", maximum)




